import re


def postprocess_text(text):
    ligatures = [
        ("ක් ර", "ක්\u200Dර"),
        ("ක් ය", "ක්\u200Dය"),
        ("ඛ් ය", "ඛ්\u200Dය"),
        ("ග් ර", "ග්\u200Dර"),
        ("ග් ය", "ග්\u200Dය"),
        ("ඝ් ර", "ඝ්\u200Dර"),
        ("ත් ය", "ත්\u200Dය"),
        ("ත් ර", "ත්\u200Dර"),
        ("ජ් ය", "ජ්\u200Dය"),
        ("ථ් ය", "ත්\u200Dය"),
        ("ද් ර", "ද්\u200Dර"),
        ("ද් ය", "ද්\u200Dය"),
        ("ධ් ය", "ධ්\u200Dය"),
        ("න් ය", "න්\u200Dය"),
        ("ප් ර", "ප්\u200Dර"),
        ("භ් ර", "ස්\u200Dර"),
        ("ම් ය", "ම්\u200Dය"),
        ("ල් ය", "ල්\u200Dය"),
        ("ව් ය", "ව්\u200Dය"),
        ("ශ් ර", "ශ්\u200Dර"),
        ("ශ් ය", "ත්\u200Dය"),
        ("ෂ් ර", "ෂ්\u200Dර"),
        ("ෂ් ය", "ෂ්\u200Dය"),
        ("ස් ර", "ස්\u200Dර"),
    ]

    for broken, fixed in ligatures:
        text = re.sub(broken, fixed, text)

    return text